#! /usr/bin/env python3
# -*- coding: utf-8 -*-

from Utility import *

def Format():

	prints(f"""

		これから文字列フォーマットを試します

		"{{}}. {{}} {{}}".format("Jul",14,2007) = "{"{}. {} {}".format("Jul",14,2007)}"
		"{{2}}/{{0}}/{{1}}".format(7,14,2007) = "{"{2}/{0}/{1}".format(7,14,2007)}"
		"{{year}}/{{month}}/{{day}}".format(month=7,day=14,year=2007) = "{"{year}/{month}/{day}".format(month=7,day=14,year=2007)}"

		正負の表記
		 "{{:}}".format(+18) = "{ "{:}".format(+18)}"
		"{{: }}".format(+18) = "{"{: }".format(+18)}"
		"{{:+}}".format(+18) = "{"{:+}".format(+18)}"
		 "{{:}}".format(-18) = "{ "{:}".format(-18)}"
		"{{: }}".format(-18) = "{"{: }".format(-18)}"
		"{{:+}}".format(-18) = "{"{:+}".format(-18)}"

		基数
		"{{:d}}".format(255) = "{"{:d}".format(255)}" (DEC)
		"{{:b}}".format(255) = "{"{:b}".format(255)}" (BIN)
		"{{:o}}".format(255) = "{"{:o}".format(255)}" (OCT)
		"{{:x}}".format(255) = "{"{:x}".format(255)}" (HEX)
		"{{:X}}".format(255) = "{"{:X}".format(255)}" (HEX)

		基数の表記
		"{{:#b}}".format(255) = "{"{:#b}".format(255)}"
		"{{:#o}}".format(255) = "{"{:#o}".format(255)}"
		"{{:#x}}".format(255) = "{"{:#x}".format(255)}"
		"{{:#X}}".format(255) = "{"{:#X}".format(255)}"

		浮動小数
		 "{{:}}".format(0.018) = "{ "{:}".format(0.018)}"
		"{{:g}}".format(0.018) = "{"{:g}".format(0.018)}"
		"{{:f}}".format(0.018) = "{"{:f}".format(0.018)}"
		"{{:e}}".format(0.018) = "{"{:e}".format(0.018)}"
		"{{:E}}".format(0.018) = "{"{:E}".format(0.018)}"

		精度 ※ 整数は非対応
		"{{:.5f}}".format(0.018) = "{"{:.5f}".format(0.018)}" ※ 小数点以下の桁数
		"{{:.5e}}".format(0.018) = "{"{:.5e}".format(0.018)}" ※ 小数点以下の有効桁数
		"{{:.2}}".format("abc")  = "{"{:.2}".format("abc")}"  ※ 文字数

		百分率
		"{{:.2%}}".format(0.018) = "{"{:.2%}".format(0.018)}"

		幅
		    "{{:10}}".format(18)    = "{  "{:10}".format(18)}"
		   "{{:10b}}".format(18)    = "{ "{:10b}".format(18)}"
		    "{{:10}}".format(0.018) = "{  "{:10}".format(0.018)}"
		 "{{:10.4f}}".format(0.018) = "{ "{:10.4f}".format(0.018)}"
		 "{{:10.2e}}".format(0.018) = "{ "{:10.2e}".format(0.018)}"
		    "{{:10}}".format("ab")  = "{  "{:10}".format("ab")}"

		0埋め
		   "{{:010}}".format(18)    = "{ "{:010}".format(18)}"
		  "{{:010b}}".format(18)    = "{"{:010b}".format(18)}"
		   "{{:010}}".format(0.018) = "{ "{:010}".format(0.018)}"
		"{{:010.4f}}".format(0.018) = "{"{:010.4f}".format(0.018)}"
		"{{:010.2e}}".format(0.018) = "{"{:010.2e}".format(0.018)}"

		桁区切り
		"{{:,}}".format(16777216)  = "{"{:,}".format(16777216)}"
		"{{:_}}".format(16777216)  = "{"{:_}".format(16777216)}"
		"{{:_b}}".format(16777216) = "{"{:_b}".format(16777216)}"
		"{{:_x}}".format(16777216) = "{"{:_x}".format(16777216)}" ※ 8進数は非対応
		"{{:,}}".format(167772.16) = "{"{:,}".format(167772.16)}"
		"{{:_}}".format(167772.16) = "{"{:_}".format(167772.16)}" ※ 整数部のみ区切る

		配置
		"{{:<+9}}".format(18) = "{"{:<+9}".format(18)}"
		"{{:^+9}}".format(18) = "{"{:^+9}".format(18)}"
		"{{:>+9}}".format(18) = "{"{:>+9}".format(18)}"
		"{{:=+9}}".format(18) = "{"{:=+9}".format(18)}"

	""")

	pnl(2)

runningDirectly(__name__,Format)