#! /usr/bin/env julia

println("""

これから演算子を試します

算術演算子
24 + 5 = $(   24 + 5   )
24 - 5 = $(   24 - 5   )
24 * 5 = $(   24 * 5   )
24 / 5 = $(   24 / 5   )
24 ÷ 5 = $(   24 ÷ 5   ) (商を整数にする除算)
24 \\ 5 = $(  24 \ 5   ) = 5 / 24
24 % 5 = $(   24 % 5   )
24 ^ 5 = $(   24 ^ 5   )
√36    = $(   √36      )
∛216   = $(   ∛216     )

inv(5)       = $(   inv(5)   ) = 1/5
fld(24,5)    = $(   fld(24,5)   ) = floor(24/5)
cld(24,5)    = $(   cld(24,5)   ) = ceil(24/5)
divrem(24,5) = $(   divrem(24,5)   ) = (24÷5,24%5)

比較演算子
24 >  5 = $(   24 >  5   )
24 >= 5 = $(   24 >= 5   )
24 ≥  5 = $(   24 ≥  5   )
24 <  5 = $(   24 <  5   )
24 <= 5 = $(   24 <= 5   )
24 ≤  5 = $(   24 ≤  5   )
24 == 5 = $(   24 == 5   )
24 != 5 = $(   24 != 5   )
24 ≠  5 = $(   24 ≠  5   )

5 ≈ (5 - 1e-10) = $(   5 ≈ (5 - 1e-10)   )

5 < 8 < 24 = $(   5 < 8 < 24   #= 複数の比較演算をまとめることができる =#)
24 ≥ 5 < 8 = $(   24 ≥ 5 < 8   )

cmp(24, 5) = $(   cmp(24, 5)   )
cmp(24,24) = $(   cmp(24,24)   )
cmp( 5,24) = $(   cmp( 5,24)   )

論理演算子
true && false = $(   true && false   )
true || false = $(   true || false   )
      ! false = $(         ! false   )

三項演算子
true  ? "yes" : "no" = "$(   true  ? "yes" : "no"   )"
false ? "yes" : "no" = "$(   false ? "yes" : "no"   )"

文字列演算子
"abc" * "def" = "$(   "abc" * "def"   )"

文字列比較演算子
"abc" == "def" = $(   "abc" == "def"   ) (等しい)
"abc" != "def" = $(   "abc" != "def"   ) (等しくない)
"abc" >  "def" = $(   "abc" >  "def"   ) (辞書順で "abc" < "def")
"abc" >= "def" = $(   "abc" >= "def"   ) (辞書順で "abc" ≦ "def")
"abc" <  "def" = $(   "abc" <  "def"   ) (辞書順で "abc" > "def")
"abc" <= "def" = $(   "abc" <= "def"   ) (辞書順で "abc" ≧ "def")

""")
#=
	Juliaでは,演算子も関数で実装されている。
	通常の演算表記 a+b+c と,関数的な表記 +(a,b,c) は等価である。
=#

println("\r\n")