#! /usr/local/bin/perl

print <<"Operators";

これから演算子を試します

算術演算子
24 +5 = @{[    24 +5   ]}
24 -5 = @{[    24 -5   ]}
24 *5 = @{[    24 *5   ]}
24 /5 = @{[    24 /5   ]}
24 \%5 = @{[   24 %5   ]}
24**5 = @{[    24**5   ]}

数値比較演算子
24  > 5 = @{[   24  > 5   ]}
24 >= 5 = @{[   24 >= 5   ]}
24  < 5 = @{[   24  < 5   ]}
24 <= 5 = @{[   24 <= 5   ]}
24 == 5 = @{[   24 == 5   ]}
24 != 5 = @{[   24 != 5   ]}
24<=> 5 = @{[   24<=> 5   ]}
24<=>24 = @{[   24<=>24   ]}
 5<=>24 = @{[    5<=>24   ]}

論理演算子
1 and 0 = @{[   1 and 0   ]}
1  && 0 = @{[   1  && 0   ]}
1  or 0 = @{[   1  or 0   ]}
1  || 0 = @{[   1  || 0   ]}
  not 0 = @{[     not 0   ]}
    ! 0 = @{[       ! 0   ]}

三項演算子
1 ? "yes" : "no" = "@{[   1 ? "yes" : "no"   ]}"
0 ? "yes" : "no" = "@{[   0 ? "yes" : "no"   ]}"

文字列演算子
"abc"."def" = "@{[   "abc"."def"   ]}"
"abc"x3 = "@{[   "abc"x3   ]}"

文字列の別の表現
qq(a"b"c) = @{[   qq(a"b"c)   ]} (エスケープ不要)
q(that's) = @{[   q(that's)   ]} (エスケープ不要)

文字列比較演算子
"abc" eq "def" = @{[   "abc" eq "def"   ]} (等しい)
"abc" ne "def" = @{[   "abc" ne "def"   ]} (等しくない)
"abc" lt "def" = @{[   "abc" lt "def"   ]} (辞書順で "abc" < "def")
"abc" le "def" = @{[   "abc" le "def"   ]} (辞書順で "abc" ≦ "def")
"abc" gt "def" = @{[   "abc" gt "def"   ]} (辞書順で "abc" > "def")
"abc" ge "def" = @{[   "abc" ge "def"   ]} (辞書順で "abc" ≧ "def")
Operators

print "\r\n\r\n";