#! /usr/local/bin/php
<?php

$i = function($v){return $v;};

print <<<"Operators"

これから演算子を試します

算術演算子
24  + 5 = {$i(   24 +5   )}
24  - 5 = {$i(   24 -5   )}
24  * 5 = {$i(   24 *5   )}
24  / 5 = {$i(   24 /5   )}
24  % 5 = {$i(   24 %5   )}
24 ** 5 = {$i(   24**5   )}

数値比較演算子
24  > 5 = {$i(   24 >5   )}
24 >= 5 = {$i(   24>=5   )}
24  < 5 = {$i(   24 <5   )}
24 <= 5 = {$i(   24<=5   )}
24 == 5 = {$i(   24==5   )}
24 != 5 = {$i(   24!=5   )}
24<=> 5 = {$i(   24<=> 5   )}
24<=>24 = {$i(   24<=>24   )}
24<=> 5 = {$i(    5<=>24   )}

論理演算子
1 and 0 = {$i(   1 and 0   )}
1  && 0 = {$i(   1  && 0   )}
1  or 0 = {$i(   1  or 0   )}
1  || 0 = {$i(   1  || 0   )}
    ! 0 = {$i(       ! 0   )}

三項演算子
1 ? "yes" : "no" = "{$i(   1 ? "yes" : "no"   )}"
0 ? "yes" : "no" = "{$i(   0 ? "yes" : "no"   )}"

文字列演算子
"abc"."def" = "{$i(   "abc"."def"   )}"

Operators;

print "\r\n\r\n";

?>