#! /usr/local/bin/php
<?php

$i = function($v){return $v;};

print <<<"Operators"

これから演算子を試します

算術演算子
24  + 5 = {$i(   24  + 5   )}
24  - 5 = {$i(   24  - 5   )}
24  * 5 = {$i(   24  * 5   )}
24  / 5 = {$i(   24  / 5   )}
24  % 5 = {$i(   24  % 5   )}
24 ** 5 = {$i(   24 ** 5   )}

数値比較演算子
24 >  5 = {$i(   24 >  5   )}
24 >= 5 = {$i(   24 >= 5   )}
24 <  5 = {$i(   24 <  5   )}
24 <= 5 = {$i(   24 <= 5   )}
24 == 5 = {$i(   24 == 5   )}
24 != 5 = {$i(   24 != 5   )}
24 <> 5 = {$i(   24 <> 5   )} (Not equal)
24<=> 5 = {$i(   24<=> 5   )}
24<=>24 = {$i(   24<=>24   )}
24<=> 5 = {$i(    5<=>24   )}

論理演算子
1 and 0 = {$i(   1 and 0   )}
1  && 0 = {$i(   1  && 0   )}
1  or 0 = {$i(   1  or 0   )}
1  || 0 = {$i(   1  || 0   )}
1 xor 0 = {$i(   1 xor 0   )}
    ! 0 = {$i(       ! 0   )}

ビット演算子 (2進数での各桁毎の論理演算)
1010 & 1001 = {$i(sprintf("%04b",   bindec("1010") & bindec("1001")   ))} (AND)
1010 | 1001 = {$i(sprintf("%04b",   bindec("1010") | bindec("1001")   ))} (OR)
1010 ^ 1001 = {$i(sprintf("%04b",   bindec("1010") ^ bindec("1001")   ))} (XOR)
     ~ 1001 = {$i(sprintf("%04b",(                 ~ bindec("1001")   )+16))} (NOT)

111111 << 2 = {$i(sprintf("%b",   bindec("111111") << 2   ))} (2桁左シフト)
111111 >> 2 = {$i(sprintf("%b",   bindec("111111") >> 2   ))} (2桁右シフト)

三項演算子
1 ? "yes" : "no" = "{$i(   1 ? "yes" : "no"   )}"
0 ? "yes" : "no" = "{$i(   0 ? "yes" : "no"   )}"

文字列演算子
"abc" . "def" = "{$i(   "abc" . "def"   )}"

文字列比較演算子
"abc"  == "def" = {$i(   "abc"  == "def"   )} (等しい)
"abc"  != "def" = {$i(   "abc"  != "def"   )} (等しくない)
"abc"  <  "def" = {$i(   "abc"  <  "def"   )} (辞書順で "abc" < "def")
"abc"  <= "def" = {$i(   "abc"  <= "def"   )} (辞書順で "abc" ≦ "def")
"abc"  >  "def" = {$i(   "abc"  >  "def"   )} (辞書順で "abc" > "def")
"abc"  >= "def" = {$i(   "abc"  >= "def"   )} (辞書順で "abc" ≧ "def")
"abc" <=> "def" = {$i(   "abc" <=> "def"   )} (辞書順で "abc"<=>"def" を演算)

配列演算子
(1,2,3) + (4,5,6)   = {$i(   array(1,2,3) + array(4,5,6)    )}
(1,2,3) == (1,2,3)  = {$i(   array(1,2,3) == array(1,2,3)   )}
(1,2) <=> (1,2,3)   = {$i(   array(1,2) <=> array(1,2,3)    )}

厳密な等号 (型の違いも判定)
3  == "3" = {$i(   3  == "3"   )} (寛容な等号)
3 === "3" = {$i(   3 === "3"   )} (厳格な等号)
3 !== "3" = {$i(   3 !== "3"   )} (厳格な不等号)

Operators;

/*
	ビット演算において,演算の内容を分かりやすくするため,意図的に本来の値から改変させたところがある
	• AND,OR,XOR,NOT においては,0埋めにより演算後も4桁が維持されるようにした (本来はない桁があったりする)
	• NOT を通常通りに計算すると,これまでなかった桁も0と見做してビット反転するため,膨大な数になる。それを防止するため,5桁目以降を切り捨てる処理をした (右端の+16)
*/

/*
	その他に...
	複合代入演算子 : += -= *= /= %= **= &= |= ^= <<= >>= .=
		a += b は a= a + b と同義。その他も同様
	加算子/減算子: ++ --
		a++ と ++a は同じ意味
		e.g.
			a=5
			b=a++
			→ aは,1増加して 6 に変化し,bには加算前の 5 が代入される
*/

print "\r\n\r\n";

?>