#! /usr/bin/php

<?php

echo "\nこれから演算子を試します\n";

echo "\n算術演算子\n";
echo "24  + 5 = ".(   24 +5   )."\n";
echo "24  - 5 = ".(   24 -5   )."\n";
echo "24  * 5 = ".(   24 *5   )."\n";
echo "24  / 5 = ".(   24 /5   )."\n";
echo "24  % 5 = ".(   24 %5   )."\n";
echo "24 ** 5 = ".(   24**5   )."\n";

print "\n数値比較演算子\n";
echo "24  > 5 = ".(   24  > 5   )."\n";
echo "24 >= 5 = ".(   24 >= 5   )."\n";
echo "24  < 5 = ".(   24  < 5   )."\n";
echo "24 <= 5 = ".(   24 <= 5   )."\n";
echo "24 == 5 = ".(   24 == 5   )." (Equal)\n";
echo "24 != 5 = ".(   24 != 5   )." (Not Equal)\n";
echo "24<=> 5 = ".(   24<=> 5   )."\n";
echo "24<=>24 = ".(   24<=>24   )."\n";
echo " 5<=>24 = ".(    5<=>24   )."\n";

print "\n論理演算子\n";
print "1 and 0 = ".(   1 and 0   )."\n";
print "1  && 0 = ".(   1  && 0   )."\n";
print "1  or 0 = ".(   1  or 0   )."\n";
print "1  || 0 = ".(   1  || 0   )."\n";
print "    ! 0 = ".(       ! 0   )."\n";

print "\n三項演算子\n";
print '1 ? "yes" : "no" = "'.(   1 ? "yes" : "no"   )."\"\n";
print '0 ? "yes" : "no" = "'.(   0 ? "yes" : "no"   )."\"\n";
print "   ( 使い方: <条件>?<真の場合の値>:<偽の場合の値> )\n";

print "\n文字列演算子\n";
print '"abc"."def" = "'.(   "abc"."def"   )."\"\n";

?>
