#! /usr/local/bin/bash

echo """

これから演算子を試します

算術演算子
24  + 5 = $((   24  + 5   ))
24  - 5 = $((   24  - 5   ))
24  * 5 = $((   24  * 5   ))
24  / 5 = $((   24  / 5   ))
24  % 5 = $((   24  % 5   ))
24 ** 5 = $((   24 ** 5   ))

比較演算子
24 >  5 = $((   24 >  5   ))
24 >= 5 = $((   24 >= 5   ))
24 <  5 = $((   24 <  5   ))
24 <= 5 = $((   24 <= 5   ))
24 == 5 = $((   24 == 5   ))
24 != 5 = $((   24 != 5   ))

論理演算子
1 & 0 = $((   1 & 0   ))
1 | 0 = $((   1 | 0   ))
  ! 0 = $((     ! 0   ))

三項演算子
1 ? \"yes\" : \"no\" → $((   1?"yes":"no"   ))
0 ? \"yes\" : \"no\" → $((   0?"yes":"no"   ))

文字列比較演算子
\"abc\" == \"def\" = $((   "abc" == "def"   ))
\"abc\" != \"def\" = $((   "abc" != "def"   ))
\"abc\" <  \"def\" = $((   "abc" <  "def"   ))
\"abc\" <= \"def\" = $((   "abc" <= "def"   ))
\"abc\" >  \"def\" = $((   "abc" >  "def"   ))
\"abc\" >= \"def\" = $((   "abc" >= "def"   ))

算術演算子 (bcコマンド, scale=1)
24 + 5 = `echo "scale=1;24+5" | bc`
24 - 5 = `echo "scale=1;24-5" | bc`
24 * 5 = `echo "scale=1;24*5" | bc`
24 / 5 = `echo "scale=1;24/5" | bc`
24 % 5 = `echo "scale=1;24%5" | bc`
24 ^ 5 = `echo "scale=1;24^5" | bc`

比較演算子 (bcコマンド)
24 >  5 = `echo "24> 5" | bc`
24 >= 5 = `echo "24>=5" | bc`
24 <  5 = `echo "24< 5" | bc`
24 <= 5 = `echo "24<=5" | bc`
24 == 5 = `echo "24==5" | bc`
24 != 5 = `echo "24!=5" | bc`

論理演算子 (bcコマンド)
1 && 0 = `echo "1 && 0" | bc`
1 || 0 = `echo "1 || 0" | bc`
   ! 0 = `echo "   ! 0" | bc`

"""

printf "\r\n\r\n"